<?php

// Інкремент та Декремент

// Префіксний інкремент
$a = 5;
echo '++$a, має бути 6: ' . ++$a . '<br />';
echo '$a, має бути 6: ' . $a . '<br />';

// Постфіксний інкремент
$b = 5;
echo '$b++, має бути 5: ' . $b++ . '<br />';
echo '$b, має бути 6: ' . $b . '<br />';

// Префіксний декремент
$c = 5;
echo '--$c, має бути 4: ' . --$c . '<br />';
echo '$c, має бути 4: ' . $c . '<br />';

// Постфіксний декремент
$d = 5;
echo '$d--, має бути 5: ' . $d-- . '<br />';
echo '$d, має бути 4: ' . $d . '<br />';