<?php

// Арифметичні оператори

// Додавання
$sum = 7 + 7;
echo 'Додавання 7 + 7 = ' . $sum;
echo '<br>';

// Віднімання
$sub = 7 - 7;
echo 'Віднімання 7 - 7 = ' . $sub;
echo '<br>';

// Множення
$mult = 7 * 7;
echo 'Множення 7 * 7 = ' . $mult;
echo '<br>';

// Ділення
$div = 7 / 7;
echo 'Ділення 7 / 7 = ' . $div;
echo '<br>';

// Залишок від ділення
$div = 17 % 5;
echo 'Залишок від ділення 17 % 5 = ' . $div;
echo '<br>';

// Зведення у ступінь
$div = 5 ** 3;
echo 'Зведення у ступінь 5 ** 3 = ' . $div;
echo '<br>';